# --------------------------------------------------------------------
# 파일 읽기 살펴보기
# --------------------------------------------------------------------
FILE_NAME='file/mydata.txt'
# --------------------------------------------------------------------
# read() 파일 안에 모든 내용 가져오기
# --------------------------------------------------------------------
fp=open(FILE_NAME,mode='r',encoding='utf-8')
allData=fp.read()
allData
fp.close()


# --------------------------------------------------------------------
# readlines() 파일 내용 모든 줄 가져오기
# --------------------------------------------------------------------
fp=open(FILE_NAME,mode='r',encoding='utf-8')
alllines=fp.readlines()
alllines
fp.close()

# --------------------------------------------------------------------
# readline() 파일 내용 1 줄 가져오기
# --------------------------------------------------------------------
fp=open(FILE_NAME,mode='r',encoding='utf-8')
while True:
    line=fp.readline()
    if not line: break
    print(f'[Line]: {line}')
fp.close()