# --------------------------------------------------------------------
# 파일 입력과 출력 (I/O)
# 스트림(Stream) : 흐름, 데이터의 흐름, 데이터의 이동 통로
#                 종류 : 입력 스트림, 출력 스트림 
# --------------------------------------------------------------------
# with ~ as 구문
# - close 기능을 자동 실행 
# --------------------------------------------------------------------
FILE_NAME='file\stream.txt'

# 파일 쓰기 ===========================================================
# mode='w,a,x'
# ====================================================================
with open(FILE_NAME,mode='w',encoding='utf-8') as f:
    f.write('이게 스트림이다')

# 파일 쓰기 ===========================================================
# mode='r'
# ====================================================================
with open(FILE_NAME,mode='r',encoding='utf-8') as f:
    print(f.read())


# 파일 복사 함수=======================================================
# 기가 맥혔다
# ====================================================================
def cp(FILE_NAME,n):
    for i in range(1,n+1):
        # 파일 이름 뒤에 1~n 숫자 붙여주기
        a=FILE_NAME[:-4]+'{}.txt'.format(i)
        # 복사하려는 파일 내용 들고오기
        with open(FILE_NAME,mode='r',encoding='utf-8') as f:
                b=f.readlines()
        # 새로 만든 파일에 복사한 내용 붙여주기
        with open(a,mode='w',encoding='utf-8') as f:
            for j in range(len(b)):
                f.write(f'{1+j}.{b[j]}')

        # with open(FILE_NAME,mode='r',encoding='utf-8') as f1:
        #     with open(a,mode='w',encoding='utf-8') as f2:
        #         f2.write(f1.read())

cp(FILE_NAME,2)