# -----------------------------------------------------------------------------------------------------
# 사용자 정의 클래스 / 커스텀 클래스
# -----------------------------------------------------------------------------------------------------
# 만들고자 하는 프로젝트에서 사용할 데이터를 저장하는 타입
# -----------------------------------------------------------------------------------------------------
# 학생 정보를 저장하고 출력
# => 학교, 이름, 학년
class A:
    num=0

    def __init__(self,num):
        self.num=num
        A.num=3

    def d(self,m):
        pass


    def c(mkdfs): 
        pass


    def b(num):
        print(A.num)
        A.c()
        A.d(A)

    # def b(self,num):
    #     pass


a=A(2)
a.d(2)
A.c()

class A:
    print('A')
    pass