# -----------------------------------------------------------------
# 강아지                                class dog:
# 이름                                      name='메리'
# 성별                                      gender='여'        속성,필드(attribute,field)
# 몸무게  => 속성, 특징, 외형 ==> 변수        weight=3.4
# 색상                                      color='흰색'
# 앉아                                      def sit(): code
# 기다려 => 동사             ==> 함수        def bark(): code   method
# 꼬리친다                                  def tail(): code
# -----------------------------------------------------------------
# 사용자 정의 클래스
class dog:
    pass 
# 클래스를 메모리 힙영역에 생성 => 객체화, 객체
# 클래스 생성 해주는 함수 => 클래스명() 생성자 함수 Constructor
mydog=dog()