# 모듈 로딩 --------------------------------------------------------------------
import pandas as pd
import Day_0102.ex_pandas_series1 as mp # 전에 만들었던 파일에 있던 모듈 사용 가능

# ------------------------------------------------------------------------------
# Seires 객체의 요소 다루기 => 인덱스 사용
# [사용법] 객체변수명[ 인덱스 ]
# ------------------------------------------------------------------------------
data = list(range(5,31,5))
sr1=pd.Series(data)

# 요소 1개 읽기---------------------------------------------------------------------------
sr1[0]
sr1[5]

for i in range(len(sr1)):
    print(sr1[i])

# 요소 여러개 읽기------------------------------------------------------------------------
# 결과 데이터 시리즈타입
sr1[[0,4]]
type(sr1[[0,4]])
type(sr1[[4]])

#요소 범위지정하여 읽기 => 변수명[시작:끝인덱스+1]
sr1[::]